
## :x: Apply Failed

[CI link](https://github.com/goda6565/ptf-backends/actions/runs/13280771315)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
module.vpc.data.aws_availability_zones.current: Reading...
module.vpc.data.aws_availability_zones.current: Read complete after 0s [id=ap-northeast-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.ecr.aws_ecr_lifecycle_policy.ecr_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "ecr_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 30
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "ptf-golang-app-ecr-repository"
    }

  # module.ecr.aws_ecr_repository.ecr_repository will be created
  + resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "ptf-golang-app-ecr-repository"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecs.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.ecs.data.aws_ecr_repository.ecr_repository will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecr_repository" "ecr_repository" {
      + arn                          = (known after apply)
      + encryption_configuration     = (known after apply)
      + id                           = (known after apply)
      + image_scanning_configuration = (known after apply)
      + image_tag_mutability         = (known after apply)
      + most_recent_image_tags       = (known after apply)
      + name                         = "ptf-golang-app-ecr-repository"
      + registry_id                  = (known after apply)
      + repository_url               = (known after apply)
      + tags                         = (known after apply)
    }

  # module.ecs.data.aws_iam_policy.managed_ecs_task_execution will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy" "managed_ecs_task_execution" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = (known after apply)
      + id               = (known after apply)
      + name             = "AmazonECSTaskExecutionRolePolicy"
      + path             = (known after apply)
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = (known after apply)
    }

  # module.ecs.data.aws_iam_policy_document.ecs_task will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ecs_task" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ssmmessages:CreateControlChannel",
              + "ssmmessages:CreateDataChannel",
              + "ssmmessages:OpenControlChannel",
              + "ssmmessages:OpenDataChannel",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # module.ecs.data.aws_iam_policy_document.ecs_task_assume_role will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ecs_task_assume_role" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + "ecs-tasks.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.ecs.data.aws_iam_policy_document.ecs_task_execution will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ecs_task_execution" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:GetParameter",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.ecs.data.aws_iam_policy_document.ecs_task_execution_assume_role will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ecs_task_execution_assume_role" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + "ecs-tasks.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.ecs.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.ecs.data.aws_ssm_parameters_by_path.ssm_parameters will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ssm_parameters_by_path" "ssm_parameters" {
      + arns            = (known after apply)
      + id              = (known after apply)
      + names           = (known after apply)
      + path            = "/ptf-golang-app/"
      + recursive       = true
      + types           = (known after apply)
      + values          = (sensitive value)
      + with_decryption = true
    }

  # module.ecs.data.aws_subnets.private will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_subnets" "private" {
      + id   = (known after apply)
      + ids  = (known after apply)
      + tags = (known after apply)

      + filter {
          + name   = "tag:Name"
          + values = [
              + "ptf-golang-app-private-*",
            ]
        }
    }

  # module.ecs.data.aws_subnets.public will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_subnets" "public" {
      + id   = (known after apply)
      + ids  = (known after apply)
      + tags = (known after apply)

      + filter {
          + name   = "tag:Name"
          + values = [
              + "ptf-golang-app-public-*",
            ]
        }
    }

  # module.ecs.data.aws_vpc.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = (known after apply)
      + cidr_block_associations              = (known after apply)
      + default                              = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = (known after apply)
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = (known after apply)
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + state                                = (known after apply)
      + tags                                 = (known after apply)

      + filter {
          + name   = "tag:Name"
          + values = [
              + "ptf-golang-app-vpc",
            ]
        }
    }

  # module.ecs.aws_cloudwatch_log_group.ecs_log_group will be created
  + resource "aws_cloudwatch_log_group" "ecs_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/ptf-golang-app"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.ecs.aws_ecs_cluster.ecs_cluster will be created
  + resource "aws_ecs_cluster" "ecs_cluster" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "ptf-golang-app-ecs-cluster"
      + tags_all = (known after apply)

      + setting (known after apply)
    }

  # module.ecs.aws_ecs_cluster_capacity_providers.ecs_capacity_provider will be created
  + resource "aws_ecs_cluster_capacity_providers" "ecs_capacity_provider" {
      + capacity_providers = [
          + "FARGATE",
        ]
      + cluster_name       = "ptf-golang-app-ecs-cluster"
      + id                 = (known after apply)
    }

  # module.ecs.aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 0
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = true
      + health_check_grace_period_seconds  = 60
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "ptf-golang-app-ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = false
        }

      + load_balancer {
          + container_name   = "ptf-golang-app"
          + container_port   = 8080
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # module.ecs.aws_ecs_task_definition.ecs_task_definition will be created
  + resource "aws_ecs_task_definition" "ecs_task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "256"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "ptf-golang-app"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = true
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # module.ecs.aws_iam_role.ecs_task will be created
  + resource "aws_iam_role" "ecs_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ptf-golang-app-ecs-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ecs.aws_iam_role.ecs_task_execution_role will be created
  + resource "aws_iam_role" "ecs_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ptf-golang-app-ecs-task-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ecs.aws_iam_role_policy.ecs_task_execution_inline_policy will be created
  + resource "aws_iam_role_policy" "ecs_task_execution_inline_policy" {
      + id          = (known after apply)
      + name        = "ptf-golang-app-ecs-task-execution-inline-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "ptf-golang-app-ecs-task-execution-role"
    }

  # module.ecs.aws_iam_role_policy.ecs_task_inline_policy will be created
  + resource "aws_iam_role_policy" "ecs_task_inline_policy" {
      + id          = (known after apply)
      + name        = "ptf-golang-app-ecs-task-inline-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "ptf-golang-app-ecs-task-role"
    }

  # module.ecs.aws_iam_role_policy_attachments_exclusive.ecs_task_execution_managed_policy will be created
  + resource "aws_iam_role_policy_attachments_exclusive" "ecs_task_execution_managed_policy" {
      + policy_arns = [
          + (known after apply),
        ]
      + role_name   = "ptf-golang-app-ecs-task-execution-role"
    }

  # module.ecs.aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "ptf-golang-app-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags_all                                                     = (known after apply)
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # module.ecs.aws_lb_listener.alb_listener will be created
  + resource "aws_lb_listener" "alb_listener" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Fixed response content"
              + status_code  = "200"
            }
        }

      + mutual_authentication (known after apply)
    }

  # module.ecs.aws_lb_listener_rule.alb_listener_rule will be created
  + resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # module.ecs.aws_lb_target_group.alb_target_group will be created
  + resource "aws_lb_target_group" "alb_target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "ptf-golang-app-alb-target-group"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = "/health_checks"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.ecs.aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "ptf-golang-app-alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # module.ecs.aws_security_group.ecs_instance will be created
  + resource "aws_security_group" "ecs_instance" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "ptf-golang-app-ecs-instance"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # module.ecs.aws_vpc_security_group_egress_rule.ecs_instance_to_https will be created
  + resource "aws_vpc_security_group_egress_rule" "ecs_instance_to_https" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = 443
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = 443
    }

  # module.ecs.aws_vpc_security_group_egress_rule.lb_to_ecs_instance will be created
  + resource "aws_vpc_security_group_egress_rule" "lb_to_ecs_instance" {
      + arn                          = (known after apply)
      + from_port                    = 8080
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
      + to_port                      = 8080
    }

  # module.ecs.aws_vpc_security_group_ingress_rule.alb_from_http will be created
  + resource "aws_vpc_security_group_ingress_rule" "alb_from_http" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = 80
    }

  # module.ecs.aws_vpc_security_group_ingress_rule.ecs_instance_from_alb will be created
  + resource "aws_vpc_security_group_ingress_rule" "ecs_instance_from_alb" {
      + arn                          = (known after apply)
      + from_port                    = 8080
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
      + to_port                      = 8080
    }

  # module.ssm_parameters.aws_ssm_parameter.ssm_parameter["TEST_SECRET"] will be created
  + resource "aws_ssm_parameter" "ssm_parameter" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/ptf-golang-app/TEST_SECRET"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.vpc.module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Name" = "ptf-golang-app-vpc-default"
        }
      + tags_all               = {
          + "Name" = "ptf-golang-app-vpc-default"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + egress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + ingress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
    }

  # module.vpc.module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name" = "ptf-golang-app-vpc-default"
        }
      + tags_all               = {
          + "Name" = "ptf-golang-app-vpc-default"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc.module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "ptf-golang-app-vpc-default"
        }
      + tags_all               = {
          + "Name" = "ptf-golang-app-vpc-default"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "ptf-golang-app-vpc-ap-northeast-1a"
        }
      + tags_all             = {
          + "Name" = "ptf-golang-app-vpc-ap-northeast-1a"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "ptf-golang-app-vpc"
        }
      + tags_all = {
          + "Name" = "ptf-golang-app-vpc"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "ptf-golang-app-vpc-ap-northeast-1a"
        }
      + tags_all                           = {
          + "Name" = "ptf-golang-app-vpc-ap-northeast-1a"
        }
    }

  # module.vpc.module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "ptf-golang-app-vpc-private"
        }
      + tags_all         = {
          + "Name" = "ptf-golang-app-vpc-private"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "ptf-golang-app-vpc-public"
        }
      + tags_all         = {
          + "Name" = "ptf-golang-app-vpc-public"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.32.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "ptf-golang-app-vpc-private-ap-northeast-1a"
        }
      + tags_all                                       = {
          + "Name" = "ptf-golang-app-vpc-private-ap-northeast-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.48.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "ptf-golang-app-vpc-private-ap-northeast-1c"
        }
      + tags_all                                       = {
          + "Name" = "ptf-golang-app-vpc-private-ap-northeast-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "ptf-golang-app-vpc-public-ap-northeast-1a"
        }
      + tags_all                                       = {
          + "Name" = "ptf-golang-app-vpc-public-ap-northeast-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "ptf-golang-app-vpc-public-ap-northeast-1c"
        }
      + tags_all                                       = {
          + "Name" = "ptf-golang-app-vpc-public-ap-northeast-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "ptf-golang-app-vpc"
        }
      + tags_all                             = {
          + "Name" = "ptf-golang-app-vpc"
        }
    }

Plan: 42 to add, 0 to change, 0 to destroy.
module.ssm_parameters.aws_ssm_parameter.ssm_parameter["TEST_SECRET"]: Creating...
module.vpc.module.vpc.aws_vpc.this[0]: Creating...
module.ecr.aws_ecr_repository.ecr_repository: Creating...
module.ecr.aws_ecr_repository.ecr_repository: Creation complete after 1s [id=ptf-golang-app-ecr-repository]
module.ecr.aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creating...
module.ssm_parameters.aws_ssm_parameter.ssm_parameter["TEST_SECRET"]: Creation complete after 1s [id=/ptf-golang-app/TEST_SECRET]
module.ecr.aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creation complete after 0s [id=ptf-golang-app-ecr-repository]
module.vpc.module.vpc.aws_vpc.this[0]: Still creating... [10s elapsed]
module.vpc.module.vpc.aws_vpc.this[0]: Creation complete after 13s [id=vpc-062502fa3da223272]
module.vpc.module.vpc.aws_internet_gateway.this[0]: Creating...
module.vpc.module.vpc.aws_route_table.public[0]: Creating...
module.vpc.module.vpc.aws_default_security_group.this[0]: Creating...
module.vpc.module.vpc.aws_route_table.private[0]: Creating...
module.vpc.module.vpc.aws_default_route_table.default[0]: Creating...
module.vpc.module.vpc.aws_subnet.private[0]: Creating...
module.vpc.module.vpc.aws_subnet.public[0]: Creating...
module.vpc.module.vpc.aws_default_network_acl.this[0]: Creating...
module.vpc.module.vpc.aws_subnet.private[1]: Creating...
module.vpc.module.vpc.aws_subnet.public[1]: Creating...
module.vpc.module.vpc.aws_default_route_table.default[0]: Creation complete after 1s [id=rtb-06c5b691ad9c5ec00]
module.vpc.module.vpc.aws_route_table.private[0]: Creation complete after 1s [id=rtb-02a749fbdb6442c1c]
module.vpc.module.vpc.aws_subnet.public[0]: Creation complete after 1s [id=subnet-0d4ddafd54b0e8e6d]
module.vpc.module.vpc.aws_subnet.private[0]: Creation complete after 1s [id=subnet-092ff86b17e91c9a0]
module.vpc.module.vpc.aws_internet_gateway.this[0]: Creation complete after 1s [id=igw-08677ace5ecc14721]
module.vpc.module.vpc.aws_route_table.public[0]: Creation complete after 1s [id=rtb-022b9ab78999bf577]
module.vpc.module.vpc.aws_eip.nat[0]: Creating...
module.vpc.module.vpc.aws_route.public_internet_gateway[0]: Creating...
module.vpc.module.vpc.aws_subnet.private[1]: Creation complete after 1s [id=subnet-0edf353447e0c4c07]
module.vpc.module.vpc.aws_route_table_association.private[0]: Creating...
module.vpc.module.vpc.aws_route_table_association.private[1]: Creating...
module.vpc.module.vpc.aws_route_table_association.private[0]: Creation complete after 1s [id=rtbassoc-0873f1d2c670716d7]
module.vpc.module.vpc.aws_route_table_association.private[1]: Creation complete after 1s [id=rtbassoc-06ec7371ef5e51ed0]
module.vpc.module.vpc.aws_eip.nat[0]: Creation complete after 1s [id=eipalloc-073f8632a48f23263]
module.vpc.module.vpc.aws_default_network_acl.this[0]: Creation complete after 2s [id=acl-022ffaeb3938341dc]
module.vpc.module.vpc.aws_route.public_internet_gateway[0]: Creation complete after 1s [id=r-rtb-022b9ab78999bf5771080289494]
module.vpc.module.vpc.aws_default_security_group.this[0]: Creation complete after 2s [id=sg-0d6da820ea8bff2f5]
module.vpc.module.vpc.aws_subnet.public[1]: Creation complete after 3s [id=subnet-058e4463b31cabeb4]
module.vpc.module.vpc.aws_route_table_association.public[1]: Creating...
module.vpc.module.vpc.aws_route_table_association.public[0]: Creating...
module.vpc.module.vpc.aws_nat_gateway.this[0]: Creating...
module.vpc.module.vpc.aws_route_table_association.public[1]: Creation complete after 0s [id=rtbassoc-0edc2cfdda7630355]
module.vpc.module.vpc.aws_route_table_association.public[0]: Creation complete after 0s [id=rtbassoc-0f42716b63fbb2012]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Still creating... [10s elapsed]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Still creating... [20s elapsed]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Still creating... [30s elapsed]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Still creating... [40s elapsed]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Still creating... [50s elapsed]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Still creating... [1m0s elapsed]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Still creating... [1m10s elapsed]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Still creating... [1m20s elapsed]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Still creating... [1m30s elapsed]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Creation complete after 1m35s [id=nat-0443e09db44c67b08]
module.vpc.module.vpc.aws_route.private_nat_gateway[0]: Creating...
module.vpc.module.vpc.aws_route.private_nat_gateway[0]: Creation complete after 1s [id=r-rtb-02a749fbdb6442c1c1080289494]
module.ecs.data.aws_subnets.private: Reading...
module.ecs.data.aws_ssm_parameters_by_path.ssm_parameters: Reading...
module.ecs.data.aws_iam_policy_document.ecs_task: Reading...
module.ecs.data.aws_iam_policy.managed_ecs_task_execution: Reading...
module.ecs.data.aws_caller_identity.current: Reading...
module.ecs.data.aws_region.current: Reading...
module.ecs.data.aws_iam_policy_document.ecs_task_assume_role: Reading...
module.ecs.data.aws_iam_policy_document.ecs_task_execution_assume_role: Reading...
module.ecs.data.aws_subnets.public: Reading...
module.ecs.data.aws_iam_policy_document.ecs_task_assume_role: Read complete after 0s [id=1077804475]
module.ecs.aws_ecs_cluster.ecs_cluster: Creating...
module.ecs.data.aws_iam_policy_document.ecs_task_execution_assume_role: Read complete after 0s [id=1077804475]
module.ecs.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.ecs.data.aws_ecr_repository.ecr_repository: Reading...
module.ecs.aws_cloudwatch_log_group.ecs_log_group: Creating...
module.ecs.data.aws_iam_policy_document.ecs_task: Read complete after 0s [id=3621793318]
module.ecs.data.aws_vpc.this: Reading...
module.ecs.aws_iam_role.ecs_task: Creating...
module.ecs.data.aws_subnets.private: Read complete after 1s [id=ap-northeast-1]
module.ecs.aws_iam_role.ecs_task_execution_role: Creating...
module.ecs.data.aws_subnets.public: Read complete after 1s [id=ap-northeast-1]
module.ecs.data.aws_caller_identity.current: Read complete after 1s [id=061051222129]
module.ecs.data.aws_ssm_parameters_by_path.ssm_parameters: Read complete after 1s [id=/ptf-golang-app/]
module.ecs.data.aws_iam_policy_document.ecs_task_execution: Reading...
module.ecs.data.aws_iam_policy_document.ecs_task_execution: Read complete after 0s [id=2439931457]
module.ecs.aws_iam_role.ecs_task: Creation complete after 1s [id=ptf-golang-app-ecs-task-role]
module.ecs.aws_iam_role_policy.ecs_task_inline_policy: Creating...
module.ecs.data.aws_ecr_repository.ecr_repository: Read complete after 1s [id=ptf-golang-app-ecr-repository]
module.ecs.aws_cloudwatch_log_group.ecs_log_group: Creation complete after 1s [id=/ecs/ptf-golang-app]
module.ecs.aws_iam_role.ecs_task_execution_role: Creation complete after 0s [id=ptf-golang-app-ecs-task-execution-role]
module.ecs.aws_iam_role_policy.ecs_task_execution_inline_policy: Creating...
module.ecs.aws_ecs_task_definition.ecs_task_definition: Creating...
module.ecs.aws_iam_role_policy.ecs_task_inline_policy: Creation complete after 0s [id=ptf-golang-app-ecs-task-role:ptf-golang-app-ecs-task-inline-policy]
module.ecs.aws_iam_role_policy.ecs_task_execution_inline_policy: Creation complete after 1s [id=ptf-golang-app-ecs-task-execution-role:ptf-golang-app-ecs-task-execution-inline-policy]
module.ecs.data.aws_vpc.this: Read complete after 2s [id=vpc-062502fa3da223272]
module.ecs.aws_security_group.ecs_instance: Creating...
module.ecs.aws_security_group.alb: Creating...
module.ecs.aws_lb_target_group.alb_target_group: Creating...
module.ecs.aws_ecs_task_definition.ecs_task_definition: Creation complete after 1s [id=ptf-golang-app]
module.ecs.data.aws_iam_policy.managed_ecs_task_execution: Read complete after 3s [id=arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]
module.ecs.aws_iam_role_policy_attachments_exclusive.ecs_task_execution_managed_policy: Creating...
module.ecs.aws_iam_role_policy_attachments_exclusive.ecs_task_execution_managed_policy: Creation complete after 0s
module.ecs.aws_lb_target_group.alb_target_group: Creation complete after 2s [id=arn:aws:elasticloadbalancing:ap-northeast-1:061051222129:targetgroup/ptf-golang-app-alb-target-group/67a6d6df33d96e81]
module.ecs.aws_security_group.alb: Creation complete after 2s [id=sg-0479ef1bd7517e71e]
module.ecs.aws_lb.alb: Creating...
module.ecs.aws_vpc_security_group_ingress_rule.alb_from_http: Creating...
module.ecs.aws_security_group.ecs_instance: Creation complete after 2s [id=sg-0b0793bd658597427]
module.ecs.aws_vpc_security_group_egress_rule.ecs_instance_to_https: Creating...
module.ecs.aws_vpc_security_group_egress_rule.lb_to_ecs_instance: Creating...
module.ecs.aws_vpc_security_group_ingress_rule.ecs_instance_from_alb: Creating...
module.ecs.aws_vpc_security_group_ingress_rule.alb_from_http: Creation complete after 0s [id=sgr-09c2e028d8b402a05]
module.ecs.aws_vpc_security_group_egress_rule.ecs_instance_to_https: Creation complete after 0s [id=sgr-07904dfac92d40280]
module.ecs.aws_vpc_security_group_ingress_rule.ecs_instance_from_alb: Creation complete after 0s [id=sgr-05fcf29d9394a7a7e]
module.ecs.aws_vpc_security_group_egress_rule.lb_to_ecs_instance: Creation complete after 0s [id=sgr-08da339f8e531b742]
module.ecs.aws_ecs_cluster.ecs_cluster: Still creating... [10s elapsed]
module.ecs.aws_ecs_cluster.ecs_cluster: Creation complete after 12s [id=arn:aws:ecs:ap-northeast-1:061051222129:cluster/ptf-golang-app-ecs-cluster]
module.ecs.aws_ecs_cluster_capacity_providers.ecs_capacity_provider: Creating...
module.ecs.aws_ecs_cluster_capacity_providers.ecs_capacity_provider: Still creating... [10s elapsed]
module.ecs.aws_ecs_cluster_capacity_providers.ecs_capacity_provider: Creation complete after 11s [id=ptf-golang-app-ecs-cluster]
╷
│ Error: creating ELBv2 application Load Balancer (ptf-golang-app-alb): operation error Elastic Load Balancing v2: CreateLoadBalancer, https response error StatusCode: 400, RequestID: 77271d66-95d0-452d-afc4-5c8a9bf617e9, api error ValidationError: At least two subnets in two different Availability Zones must be specified
│ 
│   with module.ecs.aws_lb.alb,
│   on usecases/ecs/main.tf line 74, in resource "aws_lb" "alb":
│   74: resource "aws_lb" "alb" {
│ 
╵
::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":4,"Program":"tfcmt","SHA1":"f29b6be5dfa9de479ffa69c8015300a81a894128","Vars":{},"WorkflowName":"Terraform"} -->